app/views/clubs/_form.html.erb

          <%= f.label :beer %>
          <%= f.collection_check_boxes(:beer_ids, Beer.all, :id, :title, {selected: @club.beers.map(&:id), include_hidden: false }, multiple: true , class: "checkbox inline") do |d| %>
---
SELECT "beers".* FROM "beers" INNER JOIN "beer_clubs" ON "beers"."id" = "beer_clubs"."beer_id" WHERE "beer_clubs"."club_id" = ?  [["club_id", 1]]