app/views/clubs/_form.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
                <% end %>
                <%= f.collection_select :user_id, User.all, :id, :first_name, if (@club.user.nil?)

SELECT "beers".* FROM "beers"
---
      <div class="checkbox pull-left span6">
        <%= f.collection_check_boxes(:beer_ids, Beer.all, :id, :title) %>