app/views/clubs/index.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 3  ORDER BY "users"."id" ASC LIMIT 1
---
                  <td style="vertical-align:middle;white-space:nowrap;"><%= club.url %></td>
                  <td style="vertical-align:middle;white-space:nowrap;"><%= "#{club.user.first_name},  #{club.user.last_name}" %></td>