app/views/clubs/show.html.erb

            <li>
              <a><i class="fa fa-home"></i><%= @club.address.street + " " + @club.address.house_number + ", " + @club.address.postal_code.to_s + " " + @club.address.city + ", " + @club.address.country %>
---
SELECT  "addresses".* FROM "addresses"  WHERE "addresses"."id" = ? LIMIT 1  [["id", 4]]

              </a></li>
            <li><a><i class="fa fa-user"></i> <%= "#{@club.user.first_name} #{@club.user.last_name}" %></a></li>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1

          <% @e = 0 %>
          <% @club.events.each do |event| %>
---
SELECT "events".* FROM "events"  WHERE "events"."club_id" = ?  [["club_id", 1]]