app/views/shared/_options.html.erb

SELECT  "clubs".* FROM "clubs"  WHERE "clubs"."user_id" = 1 LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'beer@beer.com' LIMIT 1
---
    <li class="menu-level2"><%= link_to "Edit Profile",edit_user_registration_path%></li>
    <% if Club.find_by_user_id(User.find_by_email(current_user.email)).nil? %>