app/views/events/_form.html.erb

          <% if current_user.has_role? :admin %>
              <%= f.collection_select :club_id, Club.all, :id, :name,
                                      if (params[:club_id])
---
SELECT "clubs".* FROM "clubs"