app/views/ratings/show.html.erb

SELECT  "ratings".* FROM "ratings"  WHERE "ratings"."id" = ? LIMIT 1  [["id", 1]]
---

  <% content_for :title, 'Rating for '+ Beer.find(@rating.beer_id).title  %>

SELECT  "criterions".* FROM "criterions"  WHERE "criterions"."rating_id" = ?  ORDER BY "criterions"."id" ASC LIMIT 1  [["rating_id", 1]]
---
          <%= User.find(@rating.user_id).email %>
    <% @rating.criterions.each do |criterion| %>