app/views/beers/index.html.erb

        <td><%= beer.title %></td>
        <td><%= "#{Category.find_by(beer.category_id).name}" %></td>
        <td><%= "#{Producer.find_by(beer.producer_id).name}" %></td>
---
SELECT  "categories".* FROM "categories"  WHERE (1) LIMIT 1
SELECT  "producers".* FROM "producers"  WHERE (1) LIMIT 1