app/controllers/clubs_controller.rb

  def index
    @clubs = Club.where(active: true)
---
SELECT "clubs".* FROM "clubs"  WHERE "clubs"."active" = 't'

  def create

    @club = Club.new(club_params)
    if (@club.active == true and current_user.has_role? :admin)
      @club.active = true
    else
      @club.active = false
    end
    if (current_user.has_role? :admin)
      #@club.user = club_params.user <- so wars vorher thorsten
      @club.user = User.find( club_params[:user_id])
    else
      @club.user = current_user
    end


    respond_to { |format|
      if @club.save
---
SELECT  "clubs".* FROM "clubs"  WHERE "clubs"."user_id" = 1 LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "clubs" ("address_id", "created_at", "name", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["address_id", 3], ["created_at", "2014-12-22 18:10:13.459336"], ["name", "m m"], ["updated_at", "2014-12-22 18:10:13.459336"], ["url", ""], ["user_id", 1]]

  def update

    #authorize!(:update, @club)
    respond_to do |format|
      if @club.update(club_params)
---
UPDATE "clubs" SET "address_id" = ?, "updated_at" = ?, "url" = ? WHERE "clubs"."id" = 3  [["address_id", 4], ["updated_at", "2014-12-22 18:17:55.589449"], ["url", "CPP.DE"]]

  def destroy
    @club.address.destroy if @club.address.present?
    @club.events.destroy_all if @club.address.present?
---
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 1]]
DELETE FROM "clubs" WHERE "clubs"."id" = ?  [["id", 1]]
SELECT  "addresses".* FROM "addresses"  WHERE "addresses"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]
SELECT "events".* FROM "events"  WHERE "events"."club_id" = ?  [["club_id", 1]]

    def set_club

      @club = Club.find(params[:id])
---
SELECT  "clubs".* FROM "clubs"  WHERE "clubs"."id" = ? LIMIT 1  [["id", 2]]