app/controllers/events_controller.rb

  def index
    @events = Event.joins(:club).where('events.sdate >= ?', Date.current).where('clubs.active = ?', true)
---
SELECT "events".* FROM "events" INNER JOIN "clubs" ON "clubs"."id" = "events"."club_id" WHERE (sdate > '2015-01-08') AND (clubs.active = 't')

  def create
    #authorize! :create, Event
    @event = Event.new(event_params)



    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("club_id", "created_at", "imageURL", "sdate", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["club_id", 1], ["created_at", "2014-12-19 16:21:04.487356"], ["imageURL", "DSC06488.JPG"], ["sdate", "2014-12-19 16:20:00.000000"], ["title", "Test"], ["updated_at", "2014-12-19 16:21:04.487356"]]

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "imageURL" = ?, "updated_at" = ? WHERE "events"."id" = 1  [["imageURL", "DSC06488.JPG"], ["updated_at", "2014-12-19 15:45:05.454334"]]