app/controllers/ratings_controller.rb

INSERT INTO "ratings" ("beer_id", "comment", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["beer_id", 1], ["comment", "good"], ["created_at", "2014-12-30 11:18:01.524795"], ["updated_at", "2014-12-30 11:18:01.524795"], ["user_id", 5]]
---
  def create
    @rating = Rating.new(rating_params)

    respond_to { |format|
      if @rating.save