app/controllers/shop_beers_controller.rb

  def index
    @shop_beers = ShopBeer.all
---
SELECT "shop_beers".* FROM "shop_beers"